src/OpenFOAM/OpenFOAM-7/tutorials/incompressible/pimpleFoam/RAS/elipsekkLOmega/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type           calculated;
        value          uniform 0;
    }
    outlet
    {
        type           calculated;
        value          uniform 0;
    }
    up
    {
        type           symmetry;
    }
    hole
    {
        type           nutLowReWallFunction;
        value          uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
